[
    {"Heading": "Javascript SDK"},
    {"Explanation": "Wouldn't it be great if you could create & embed StackBlitz projects on-demand in your docs, examples, blog posts... in just a couple lines of code?"},
    {"Explanation2": "This is exactly what our Javascript SDK allows you to do. Even better, the SDK even gives you full control of the StackBlitz VM- allowing you to build rich & interactive experiences around your projects."},
    {"Explanation3": "The SDK is 2kb gzipped (!) and you can install it from NPM:"},
    {"img1": ""},
    {"Explanation4": "Or add a script tag to the UMD build on jsDelivr/Unpkg — the SDK will be available on window as StackBlitzSDK:"},
    {"img2": ""},
    {"SubHeading1": "Generate and Embed New Projects"},
    {"SubExplanation1": "Creating custom projects on-demand from any data source is super simple with the SDK. There are two methods for doing this: openProject to create a new project & open it in a new tab (or current window). embedProject to create a new project & embed it on the current page. View live demo on StackBlitz."},
    {"SubHeading1.1": "sdk.openProject(project[, opts])"},
    {"SubExplanation1.1": "Create a new project and open it in a new tab (or in the current window)."},
    {"SubHeading1.1.1": "Project payload"},
    {"img3": ""},
    {"SubHeading1.1.2": "Options"},
    {"img4": ""},
    {"SubHeading1.1.3": "Required files for templates"},
    {"img5": ""},
    {"SubHeading1.2": "sdk.embedProject(elementOrId, project[, embedOpts])"},
    {"SubExplanation1.2": "Create a new project and embed it on the current page. Returns a promise resolving it's VM instance."},
    {"SubExplanation1.2.1": "elementOrId: Either an element's ID string or the target HTMLElement itself."},
    {"SubExplanation1.2.2": "project: The same project payload as the openProject method."},
    {"SubExplanation1.2.3": "embedOpts: Optional argument that allows you to implement various embed controls:"},
    {"SubHeading1.2.1": "Embed options"},
    {"img6": ""},
    {"SubHeading2": "Open and Embed Github Repos"},
    {"SubExplanation2": "Yup, you can point directly at Github repos containing Angular/React projects and it'll automatically pull them down & run them. View live demo on StackBlitz."},
    {"SubHeading2.1": "sdk.openGithubProject(repoSlug[, opts])"},
    {"SubExplanation2.1": "Open a project from Github and open it in a new tab (or in the current window)."},
    {"SubExplanation2.1.1": "repoSlug: String of the Github username, repo and optionally branch/tag/commit."},
    {"SubExplanation2.1.2": "opts: The same options object as openProject"},
    {"SubHeading2.2": "sdk.embedGithubProject(elementOrId, repoSlug[, embedOpts])"},
    {"SubExplanation2.2": "Embeds a project from Github on the current page. Returns a promise resolving it's VM instance."},
    {"SubExplanation2.2.1": "elementOrId: Either an element ID string or the target HTMLElement itself."},
    {"SubExplanation2.2.2": "repoSlug: String of the Github username, repo and optionally branch/tag/commit."},
    {"SubExplanation2.2.3": "embedOpts: Optional embed options object"},
    {"SubHeading3": "Open and Embed StackBlitz Projects"},
    {"SubExplanation3": "If you have a specific StackBlitz project ID you want to open or embed, you can use these methods:"},
    {"SubHeading3.1": "sdk.openProjectId(projectId[, opts])"},
    {"SubExplanation3.1": "Open an existing StackBlitz project in a new tab (or in the current window)."},
    {"SubExplanation3.1.1": "projectId: The ID of the StackBlitz project to open"},
    {"SubExplanation3.1.2": "opts: The same options object as openProject"},
    {"SubHeading3.2": "sdk.embedProjectId(elementOrId, projectId[, embedOpts])"},
    {"SubExplanation3.2": "Embeds an existing StackBlitz project on the current page. Returns a promise resolving it's VM instance."},
    {"SubExplanation3.2.1": "elementOrId: Either an element ID string or the target HTMLElement itself."},
    {"SubExplanation3.2.2": "projectId: The ID of the StackBlitz project to open"},
    {"SubExplanation3.2.3": "embedOpts: Optional embed options object"},
    {"SubHeading4": "Controlling the VM"},
    {"SubExplanation4": "All of the embed methods on the SDK automatically connect to the embedded StackBlitz VM and return a promise containing an initialized VM class. This allows you to have programmatic access of the file system, package manager, editor, and more."},
    {"SubHeading4.1": "vm.applyFsDiff(diff)"},
    {"SubExplanation4.1": "Apply batch updates to the FS in one call. Returns a promise. diff: A diff object containing files to create and delete."},
    {"SubHeading4.1.1": "DIFF OBJECT"},
    {"img7": ""},
    {"SubHeading4.2": "vm.getFsSnapshot()"},
    {"SubExplanation4.2": "Get a snapshot of the entire FS. Returns a promise resolving the file system object."},
    {"SubHeading4.3": "vm.editor.openFile(path)"},
    {"SubExplanation4.3": "Open a file in the editor that exists in the current FS. Returns a promise.path: String of entire file path (i.e 'somefolder/index.js')"},
    {"SubHeading4.4": "vm.preview.origin"},
    {"SubExplanation4.4": "String. The URL of the preview domain that the user can open in new tab(s) as they use the embed. Every project created with the embedProject method gets its own unique preview URL.    "},
    {"SubHeading4.5": "vm.getDependencies()"},
    {"SubExplanation4.5": "Returns a promise resolving an object containing the currently installed dependencies with corresponding version numbers."}
]
